A622266/micropython/ports/mimxrt/machine_spi.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2020-2021 Damien P. George
 * Copyright (c) 2021 Robert Hammelrath
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <string.h>

#include "py/runtime.h"
#include "py/mphal.h"
#include "py/mperrno.h"
#include "extmod/modmachine.h"
#include CLOCK_CONFIG_H

#include "fsl_cache.h"
#include "fsl_dmamux.h"
#include "fsl_iomuxc.h"
#include "fsl_lpspi.h"
#include "fsl_lpspi_edma.h"
#include "fsl_qtmr.h"
#include "dma_manager.h"
#include "hal/pwm_backport.h"  // QTMR_SetupPwm_u16 -- a project-local backport, not stock SDK

// --- Periodic DMA transfer extension (SPI.dma_periodic_start() and friends) ---
//
// Added to drive a fixed-rate register update (e.g. a DDS phase/frequency tuning word)
// with hardware timing, independent of CPU polling -- ordinary machine.SPI.write() here
// calls LPSPI_MasterTransferBlocking() (see machine_spi_transfer() below), a fully
// synchronous, CPU-blocking call with no DMA involvement at all; measured sustained
// throughput for that path was ~2000Hz when interleaved with real-time audio I2S, far
// short of a 192kHz per-sample DDS update target. See this project's own memory/design
// notes (not reproduced here) for the fuller rationale; this comment covers only the
// verified hardware facts this implementation depends on.
//
// Verified against the actual vendored SDK/device headers for this chip (i.MX RT1062),
// not assumed:
//   - PIT and GPT have NO entry in the dma_request_source_t enum
//     (sdk/devices/MIMXRT1062/MIMXRT1062.h) -- neither can trigger DMAMUX directly.
//   - Quad Timer (QTMR/TMR) modules DO have dedicated DMAMUX request-source entries for
//     their comparator-preload/reload ("Cmpld") events, e.g.
//     kDmaRequestMuxQTIMER2Cmpld1Timer0Cmpld2Timer1 for TMR2 channel 0.
//   - QTMR_EnableDma()/kQTMR_ComparatorPreload1DmaEnable (sdk/drivers/qtmr_1/fsl_qtmr.h)
//     arms that DMA request on a QTMR channel's period-reload event.
//   - QTMR_SetTimerPeriod()'s own doc comment: "writes to COMP1 or COMP2 depending on
//     count direction" -- an up-counting channel (this project's free-running,
//     kQTMR_PriSrcRiseEdge-off-an-internal-clock configuration, the same recipe
//     machine_pwm.c already uses for TMR-backed PWM objects) writes/compares against
//     COMP1, hence Preload1 (not Preload2) is the correct DMA-enable bit here.
//   - Pin D15 (SoC pad GPIO_AD_B1_03, this project's I/O_UPDATE pin per prior bring-up)
//     has a native alternate-function mux to QTIMER3_TIMER3
//     (IOMUXC_GPIO_AD_B1_03_QTIMER3_TIMER3, sdk/devices/MIMXRT1062/drivers/fsl_iomuxc.h)
//     -- so TMR3 channel 3, run as an ordinary hardware PWM exactly like
//     machine_pwm.c's QTMR_SetupPwm_u16() path, can generate the I/O_UPDATE latch pulse
//     with zero CPU/DMA involvement, no GPIO-toggle-via-DMA hack needed.
//   - LPSPI's own automatic FIFO-empty DMA request (its DER register) is deliberately
//     NOT used or enabled anywhere in this file -- it would be paced by the SPI baud
//     rate, not by the QTMR-sourced 192kHz trigger, and the two must not both drive the
//     same DMAMUX channel. Writes to TDR here happen unconditionally at the QTMR's pace;
//     the caller is responsible for choosing a baudrate high enough that one frame's
//     clock-out time stays comfortably under one rate_hz period (e.g. an 8-byte AD9910
//     Profile 0 write is 64 bits; at 192kHz that leaves ~5.2us, so a >=20Mbps baudrate
//     is needed for real margin -- NOT YET BENCH-VALIDATED, see the module's own
//     dma_periodic_start() docstring below).
//
// NOT yet verified -- real open items, deliberately left as runtime-computed or
// explicit caller-supplied values rather than guessed constants:
//   - The exact QTMR2 channel-0 tick count for a given rate_hz: computed at
//     spi_dma_periodic_start() time from CLOCK_GetFreq(kCLOCK_IpgClk), mirroring
//     machine_pwm.c's configure_qtmr()/calc_prescaler() exactly, not hardcoded.
//   - I/O_UPDATE pulse width/phase relative to the SPI frame's completion -- exposed as
//     explicit io_update_duty_u16/io_update_phase_ticks arguments rather than a default,
//     because getting this wrong either misses the datasheet's I/O_UPDATE setup/hold
//     window or clips into the next frame; needs ADALM2000 bench measurement.
//   - Whether TMR2 channel 0 and TMR3 channel 3 are free at runtime on top of whatever
//     else the running firmware claims (this file does not check for conflicts with
//     machine.PWM objects a user script may have already created on those same
//     channels -- a real gap, not yet handled).
//   - D-cache coherency around the ring buffer (RESOLVED 2026-09-06): a frequency-sweep
//     bench test found this exact gap for real -- dma_periodic_write() calls succeeded
//     and produced genuinely varying content (confirmed via the Teensy's own debug log),
//     but the DDS output never changed, stuck on whatever the first write left in RAM.
//     Fixed by adding DCACHE_CleanByRange() after both the initial memset() in
//     dma_periodic_start() and every memcpy() in dma_periodic_write(). Re-verify the
//     sweep test again with this fix before considering it fully closed.
//   - Multi-byte frame bit-ordering on the wire, end to end. dma_periodic_start() widens
//     LPSPI's TCR.FRAMESZ so hardware holds chip-select low across a whole
//     instruction-byte+payload frame instead of toggling it every byte (see that
//     function's own comment for why this is a read-modify-write with a real
//     precondition, not a from-scratch TCR reconstruction) -- but nobody has yet
//     compared a byte captured off this DMA path against a known-good blocking-mode
//     write of the same register on a logic analyzer. Do not trust this produces a
//     correct AD9910/9952/9954 register write until that comparison has been done.

#define DEFAULT_SPI_ID          (0)
#define DEFAULT_SPI_BAUDRATE    (1000000)
#define DEFAULT_SPI_POLARITY    (0)
#define DEFAULT_SPI_PHASE       (0)
#define DEFAULT_SPI_BITS        (8)
#define DEFAULT_SPI_FIRSTBIT    (kLPSPI_MsbFirst)
#define DEFAULT_SPI_DRIVE       (6)

